_protected/frontend/controllers/SiteController.php

    public function actionIndex()
    {
        $model = new Stockitems();


        return $this->render('index',[
        'model' => json_encode(Stockitems::find()->all())
        ]);
---
SELECT * FROM `stockitems`